import { Wonder } from './wonder';

export class WondersService{
    wonders:Wonder[]=[{title:"Александрийский маяк",
    about:"После основания города Александрия на территории современного Египта, началось его быстрое развитие как экономического и культурного центра."+
    "Торговые корабли стали частыми посетителями нового центра международной торговли. Тогда же стал вопрос о строительстве маяка. Построен он был на острове Фарос,"+
    " близ Александрии, отчего его часто называют Фаросским маяком. Планировалось построить его за 20 лет, однако архитекторы и рабочие управились за 12."+
    "Фаросское чудо света долгое время выполняло свои функции, пока в XII веке город не разорился и маяку перестали уделять должный уход,"+
    " а многие материалы и инструмент были разворованы. В XIV веке постройка была окончательно разрушена в результате землетрясения. "+
    "Впоследствии его обломки были использованы для строительства арабской крепости Кайт-Бей.",
    image:"/assets/image/qw.jpg"
    },
    {title:"Пирамида Хеопса",
    about:"Пирамида Хеопса является одним из семи чудес света и единственным, сохранившихся до наших дней. Хеопс — это древнегреческое имя египетского фараона, "+
    "для которого пирамида была возведена как гробница в 2580 году до нашей эры. Древнее египетское имя этого фараона было Chufu. Пирамида носит название "+
    "«Ахет-Хуфу», что означает «ГоризонтХуфу». Архитектором стал Хемиун, который был племянником Хеопса. Строительство продолжалось двадцать лет.",
    image:"/assets/image/zz.jpg"
    }]

    getWonder()
    {
        return this.wonders;
    }
}